# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.  




# xyz = []
       
# for i in range(3):
#     xyz.append(input(f"Введите значение {xyz[i]} (0 либо 1): "))
#     for j in range(3):
#         xyz.append(input(f"Введите значение {xyz[i,j]} (0 либо 1): "))


# left = not (xyz[0] or xyz[1] or xyz[2])
# right = not xyz[0] and not xyz[1] and not xyz[2]
# result = left == right


# if result == True:
#     print(f"Утверждение истинно")
# else:
#     print(f"Утверждение ложно")
